app/controllers/admin/elections_controller.rb

    def show
      @election = Election.find(params[:id])
---
SELECT `elections`.* FROM `elections` WHERE `elections`.`id` = 1 LIMIT 1

    def create
      @election = Election.new(election_params)
      @election.config_yaml = ""
      if @election.save
        (1..5).each do |i|
          project = Project.new
          project.election = @election
          project.number = i.to_s
          project.title = "Example Project " + i.to_s
          project.description = "Example description " + i.to_s + "."
          project.cost = i * 1000
          project.save!
---
INSERT INTO `elections` (`name`, `slug`, `config_yaml`, `created_at`, `updated_at`) VALUES ('testing-mes', 'testing-mes', '', '2024-03-22 06:10:49', '2024-03-22 06:10:49')
INSERT INTO `projects` (`election_id`, `number`, `cost`, `created_at`, `updated_at`) VALUES (2, '1', 1000, '2024-03-22 06:10:49', '2024-03-22 06:10:49')

    def edit
      @election = Election.find(params[:id])
---
SELECT `elections`.* FROM `elections` WHERE `elections`.`id` = 2 LIMIT 1

    def update
      @election = Election.find(params[:id])
      raise "error" if !current_user.can_update_election?(@election)

      respond_to do |format|
        if @election.update(election_params)
---
SELECT `elections`.* FROM `elections` WHERE `elections`.`id` = 2 LIMIT 1
UPDATE `elections` SET `elections`.`budget` = 6000, `elections`.`time_zone` = 'International Date Line West', `elections`.`config_yaml` = 'workflow: [knapsack, thanks]\r\navailable_locales: [en]\r\ndefault_locale: en\r\nshow_public_results: false\r\nallow_local_voting: false\r\nallow_remote_voting: true\r\nremote_voting_free_verification: true\r\nfree_verification_use_captcha: false\r\nknapsack:\r\n  has_budget_limit: true\r\n  has_n_project_limit: false\r\n  total_tokens: 15\r\n  max_n_projects: 4\r\n  shuffle_projects: true\r\n', `elections`.`updated_at` = '2024-03-22 06:11:55', `elections`.`remarks` = '' WHERE `elections`.`id` = 2

    def analytics
      @election = Election.find(params[:id])
      workflow = @election.config[:workflow].flatten

      log_activity('analytics', note: @election.id.to_s)

      # Find UTC offset.
      utc_offset = ActiveSupport::TimeZone.seconds_to_utc_offset(@election.utc_offset_in_seconds)

      # Construct the filter string. Filter strings are used to filter
      # the vote results to a particular place.
      # Disable this for now until it's fully supported.
=begin
      filter_clauses = []
      filter_clauses << 'voters.authentication_method = ' + Voter.sanitize(params[:authentication_method]) if params.key?(:authentication_method)
      filter_clauses << 'voters.location_id = ' + Voter.sanitize(params[:location_id]) if params.key?(:location_id)
      filter_clauses << 'voters.data LIKE \'%"shuffled":' + (params[:shuffled] != '0').to_s  + '%\'' if params.key?(:shuffled)  # crude way
      filter = filter_clauses.join(' AND ')
=end
      filter = ''

      @authentication_method = params[:authentication_method]
      @location_name = Location.find(params[:location_id]).name if params.key?(:location_id)

      Globalize.with_locale(@election.config[:default_locale]) do
        @projects = @election.projects.map do |p|
---
SELECT `elections`.* FROM `elections` WHERE `elections`.`id` = 2 LIMIT 1
SELECT projects.id, vote_knapsacks.cost AS knapsack_cost, COUNT(voters.id) AS vote_count FROM `projects` LEFT OUTER JOIN vote_knapsacks ON vote_knapsacks.project_id = projects.id LEFT OUTER JOIN voters ON voters.id = vote_knapsacks.voter_id AND voters.void = 0 WHERE `projects`.`election_id` = 2 GROUP BY projects.id, vote_knapsacks.cost ORDER BY vote_count DESC, projects.sort_order